InformationRegisters/ПлановыйЛимит.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>ПлановыйЛимит</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Норматив</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормативныйМаксимум</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентСрочности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПлановыйЛимит/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ЗаписатьВРегистр()
	
	УдалитьИзРегистра();
	
	НоваяЗапись = РегистрыСведений.ПлановыйЛимит.СоздатьМенеджерЗаписи();
    НоваяЗапись.Период = Период;
    НоваяЗапись.Норматив = Норматив;
    НоваяЗапись.Подразделение = Подразделение;
    НоваяЗапись.Записать();
    	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Период=НачалоДня(ТекущаяДата());
	ПериодОт=НачалоДня(ДобавитьМесяц(ТекущаяДата(),-1));
	ОбновитьДиаграмму();	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ериод=НачалоДня(ТекущаяДата());
	ПериодОт=НачалоДня(ДобавитьМесяц(ТекущаяДата(),-1));
	ОбновитьДиаграмму();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДиаграмму()
	Если ЗначениеЗаполнено(Подразделение) Тогда
		
		Данные=ПолучитьДанныеДиаграммы(Подразделение);
		Если ЗначениеЗаполнено(Данные) Тогда
		   ОбновитьДанныеДиаграммы(Данные);
	    Иначе
		   Диаграмма.Очистить();
		   ПериодОт=Неопределено;
		   ПериодДо=Неопределено;
		КонецЕсли; 
	КонецЕсли	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеДиаграммы(Подразделение)
	
	НетИзмененийМесяц=Ложь;
	ПрошлыйМесяц=ПериодОт;
	
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ПлановыйЛимит.Норматив,
	             |	ПлановыйЛимит.НормативныйМаксимум,
				 |	ПлановыйЛимит.Период КАК Период
	             |ИЗ
	             |	РегистрСведений.ПлановыйЛимит КАК ПлановыйЛимит
	             |ГДЕ
	             |	ПлановыйЛимит.Подразделение = &Подразделение
	             |	И ПлановыйЛимит.Период >= &Период
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	ПлановыйЛимит.Период";
				 
	Запрос.УстановитьПараметр("Подразделение",Подразделение);
	Запрос.УстановитьПараметр("Период",ПрошлыйМесяц);

	Результат=Запрос.Выполнить();
	
	Выборка=Результат.Выбрать();
	
	Если Выборка.Количество()=0 Тогда
		
			НетИзмененийМесяц=Истина;
	
		    Запрос=Новый Запрос;
			Запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
			             |	ПлановыйЛимит.Норматив,
			             |	ПлановыйЛимит.НормативныйМаксимум,
			             |	ПлановыйЛимит.Период КАК Период
			             |ИЗ
			             |	РегистрСведений.ПлановыйЛимит КАК ПлановыйЛимит
			             |ГДЕ
			             |	ПлановыйЛимит.Подразделение = &Подразделение
			             |
			             |УПОРЯДОЧИТЬ ПО
			             |	ПлановыйЛимит.Период УБЫВ";

			Запрос.УстановитьПараметр("Подразделение",Подразделение);

			Результат=Запрос.Выполнить();
			
			Выборка=Результат.Выбрать();

	
	КонецЕсли; 
		
	МассивИзменений=Новый Массив();
	
	Пока Выборка.Следующий() Цикл
		
		МассивДата=Новый Массив();
		
		Если НетИзмененийМесяц Тогда
			МассивДата.Добавить(ПрошлыйМесяц);
		Иначе
			МассивДата.Добавить(НачалоДня(Выборка.Период));
		КонецЕсли; 

		МассивДата.Добавить(Выборка.Норматив);
		МассивИзменений.Добавить(МассивДата);

	КонецЦикла;
	
	Возврат МассивИзменений;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьДанныеДиаграммы(Данные)
	
		МассивИзменений=Данные;
		ПрошлыйМесяц=ПериодОт;
		
		Диаграмма.Очистить();
		Диаграмма.ТипДиаграммы=ТипДиаграммы.График;
		Диаграмма.РежимСглаживания=РежимСглаживанияДиаграммы.ГладкаяКривая;
		Диаграмма.НатяжениеСглаживания=70;
		Диаграмма.РежимПолупрозрачности=РежимПолупрозрачностиДиаграммы.НеИспользовать;
		
		Серия=Диаграмма.Серии.Добавить("Норматив");
		Серия.Цвет=WebЦвета.ЗеленыйЛес;
		Серия.Маркер=ТипМаркераДиаграммы.Круг;
		
		Диаграмма.Обновление=Ложь;

		Инд=0;
		Инд2=0;
		МДень=ПрошлыйМесяц;
		ТНорм=МассивИзменений[0][1];

		ПоследнийУстановленный=НачалоДня(МассивИзменений[МассивИзменений.Количество()-1][0]);
		Если НачалоДня(ТекущаяДата())>ПоследнийУстановленный Тогда
			 ПоследнийУстановленный=НачалоДня(ТекущаяДата());
		КонецЕсли;
		 
		ПериодДо=ПоследнийУстановленный; 
		
		Пока МДень<=ПоследнийУстановленный Цикл
			
			
			Если (Инд<МассивИзменений.Количество()) И (МДень=НачалоДня(МассивИзменений[Инд][0])) Тогда
			 
			 	ТНорм=МассивИзменений[Инд][1];
			    Инд=Инд+1;
			КонецЕсли;
			
			Если МДень=НачалоДня(Период) Тогда
			
				Норматив=ТНорм;
			
			КонецЕсли; 
			  
			Диаграмма.Точки.Добавить(Формат(МДень,"ДФ=dd.MM"));
			
			Диаграмма.УстановитьЗначение(Инд2,0,ТНорм);
			
			МДень=МДень+60*60*24;
			Инд2=Инд2+1;
		
		КонецЦикла; 
		
		Диаграмма.Обновление=Истина;
	
	КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьВРегистр();
	ОбновитьДиаграмму();
КонецПроцедуры

&НаКлиенте
Процедура ПериодОтПриИзменении(Элемент)
	
	Если ПериодОт>ПериодДо Тогда
	
		ПериодОт=ПериодДо;
	
	КонецЕсли; 
	
	ОбновитьДиаграмму();
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	УдалитьИзРегистра();
	ОбновитьДиаграмму();
КонецПроцедуры

&НаСервере
Процедура УдалитьИзРегистра()
	Выборка = РегистрыСведений.ПлановыйЛимит.Выбрать(Период, Период);   
	Пока Выборка.Следующий() Цикл
		Если Выборка.Подразделение=Подразделение Тогда
		
			Выборка.ПолучитьМенеджерЗаписи().Удалить();
		
		КонецЕсли; 

	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ОбновитьДиаграмму();
КонецПроцедуры
